StoveOpt/foamfiles/counterFlowFlame2D/case_125/system/run/attempt_1_blockMeshDict.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
/* Cookstove body geometry:*/
(0.0 0.0 0.01)
(0.1 0.0 0.01)
(0.0 0.15 0.01)
(0.1 0.15 0.01)
(0.1 0.16 0.01)
(0.0 0.16 0.01)
(0.0 0.3 0.01)
(0.1 0.3 0.01)
(0.17 0.3 0.01)
(-0.07 0.3 0.01)
(-0.07 0.5 0.01)
(-0.04 0.5 0.01)
(0.14 0.5 0.01)
(0.17 0.5 0.01)
(-0.04 0.33 0.01)
(0.14 0.33 0.01)
(0.025 0.076 0.01)
(0.075 0.076 0.01)
(0.075 0.152 0.01)
(0.025 0.152 0.01)
(0.0 0.33 0.01)
(0.1 0.33 0.01)  

  
/*Back plane*/                                                                    
(0.0 0.0 -0.01)
(0.1 0.0 -0.01)
(0.0 0.15 -0.01)
(0.1 0.15 -0.01)
(0.1 0.16 -0.01)
(0.0 0.16 -0.01)
(0.0 0.3 -0.01)
(0.1 0.3 -0.01)
(0.17 0.3 -0.01)
(-0.07 0.3 -0.01)
(-0.07 0.5 -0.01)
(-0.04 0.5 -0.01)
(0.14 0.5 -0.01)
(0.17 0.5 -0.01)
(-0.04 0.33 -0.01)
(0.14 0.33 -0.01)
(0.025 0.076 -0.01)
(0.075 0.076 -0.01)
(0.075 0.152 -0.01)
(0.025 0.152 -0.01)
(0.0 0.33 -0.01)
(0.1 0.33 -0.01)                                                                    
                                                                   
);

blocks
(
    hex (0 1 2 3 0 1 2 3) (20 20 1) simpleGrading (1 1 1) // block 0
    hex (2 3 4 5 2 3 4 5) (20 20 1) simpleGrading (1 1 1) // block 1
    hex (5 4 7 6 5 4 7 6) (20 20 1) simpleGrading (1 1 1) // block 2
    hex (9 14 15 8 7 6 9 14) (20 20 1) simpleGrading (1 1 1) // block 3
    hex (9 14 11 10 9 14 11 10) (20 20 1) simpleGrading (1 1 1) // block 4
    hex (15 8 13 12 15 8 13 12) (20 20 1) simpleGrading (1 1 1) // block 5
);

edges
(
line (0 1)
line (0 2)
line (1 3)
line (2 5)
line (3 4)
line (5 6)
line (4 7)
line (6 9)
line (7 8)
line (9 10)
line (8 13)
line (10 11)
line (11 14)
line (14 15)
line (15 12)
line (12 13)
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
            (19 18 39 40)
			(16 17 38 37)
			(16 19 40 37)
			(17 18 39 38)
        );
    }
    primary_air
    {
        type patch;
        faces
        (
            (0 1 22 21)
        );
    }
    secondary_air_RHS
    {
	type patch;
	faces
	(
			(3 5 25 24)
	);
    }
    secondary_air_LHS
    {
	type patch;
	faces
	(
			(2 5 26 23)
	);
    }
    outlet
    {
        type patch;
        faces
        (
            (10 11 32 31)
			(12 13 33 34)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (16 17 18 19)
			(37 38 39 40)
			(0 1 3 2)
			(21 22 24 23)
			(2 3 4 5)
			(23 24 25 26)
			(5 4 7 6)
			(26 25 28 27)
			(9 14 11 10)
			(30 35 32 31)
			(15 8 13 12)
			(36 28 34 33)
			(9 14 21 6) // Front
			(6 7 22 21) 
			(7 8 15 22)
			(30 35 41 27) //Back
			(27 28 42 41)
			(28 29 36 42)
			
			
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
